# Задача 1: Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих
# строках записаны N целых чисел Ai.
# Последняя строка содержит число X

# 5
# 1 2 3 4 5
# 3
# -> 1


import random
n = int(input('Введите длину массива: '))
x = int(input('Введите число, которое хотите найти в массиве: '))
count = 0
array = [random.randint(1, 6) for i in range(n)]
for i in array:
    if x == i:
        count += 1 
    print(i, end=' ')
print()
print(f'Число {x} встречается в массиве {count} раз(a)')